Repository: jannessm/songmachine-app
Catalog: src/assets/i18n/*.xlf
Languages: de, es, it

# menu.export.title
source: export as
de: Exportieren als
es: Exportar como
it: Salva come

# menu.export.st
source: Songmachine (.st)
de: Songmachine Format (.st)
it: File Songmachine (.st)

# menu.export.sng
source: Songbeamer (.sng)
de: Songbeamer Format (.sng)
it: File Songbeamer (.sng)

# menu.export.pptx
source: Powerpoint (.pptx)
it: File Powerpoint (.pptx)

source: Books
de: Bücher
es: Cancionero
it: Raccolte

source: Songs
de: Lieder
es: Canciones
it: Brani

# alert.title
source: Attention
de: Achtung
es: Atención
it: Attenzione

# alert.sureAboutDelete
source: Should this element be deleted?
de: Soll dieses Element wirklich gelöscht werden?
es: Seguro que quieres eliminar este elemento?
it: Vuoi eliminare davvero questo elemento?

# alert.cancel
source: Cancel
de: Abbrechen
es: Cancelar
it: Annulla

# alert.closeWithoutSaving
source: The last changes could be lost. Should they be saved?
de: Die letzten Änderungen werden verloren gehen. Soll diese vorher gespeichert werden?
es: Todos modificaciónes van deshacer. Quieres guadarlo?
it: Le ultime modifiche apportate andranno perse, vuoi salvarle?

# alert.doNotSave
source: Do not save
de: Nicht speichern
es: Deshacer
it: Non salvare

# alert.save
source: save
de: Speichern
es: Guardar
it: Salva

# error.add.form.title.missing
source: A title has to be added!
de: Es muss ein Titel angegeben werden!
es: Necesite un título!
it: Inserire un titolo

# help.title
source: Help
de: Hilfe
es: Ayuda
it: Aiuto

# help.editor.title
source: Editor
it: Editore

# help.editor.introduction
source: Songmachine offers an own format to save and administrate your songs easily. Here is a brief overview of all functionality available in this format.
de: Songmachine bietet ein besonderes Format mit dessen Hilfe Lieder einfach verwaltet werden können. Auf dieser Seite befindet sich eine Übersicht über alle verfügbaren Funktionen.
es: Songmachine oferte un formato especial con que se admistra canciones muy facíl. En esté página encontra una visión general de todas funciones soportido.
it: Songmachine offre un formato speciale per scrivere e modificare brani. In questa pagina vengono elencate tutte le funzionalità disponibili.

# help.editor.elements
source: Special elements
de: Besondere Elemente
es: Elementos especiales
it: Caratteristiche particolari

# help.editor.meta.title
source: General information
de: Generelle Informationen
es: Informaciones generales
it: Proprietà

# help.editor.meta.description
source: For each song, additional general information can be added. These include the title, artist, BPM and references to books where the song can be found. All these informations can be used to search a song in the browser view. These informations are added in one line inside of square brackets and seperated by ;. Here is an example:
de: Songmachine biete folgende Funktionen, um Lieder mit generellen Informationen zu speichern. Diese sind Titel, Künstler, BPM und Verweise auf Liederbücher und ihre Nummern, unter denen das Lied zu finden ist. Nach allen folgenden Angaben kann auch in der Liedübersicht gesucht werden. Diese Informationen werden alle hintereinander in eckige Klammern geschrieben und durch Semikolons getrennt. Hier ein Beispiel:
es: En Songmachine puedes añadir informaciones generales a tus canciones. Los son título, ártista, bpm y referencias a cancioneros y las numeros. Todas informaciones ayuden buscar canciones en la visión general de caciones. Se los escriben entre chorchetes uno detrás de otro y seperado con puntos y comas. Un ejemplo:
it: Songmachine offre la possibilità di salvare un brano e le sue proprietà, ovvero titolo, autore, BPM (tempo di metronomo) e rimando ad una o più raccolte numerate dove verrà salvato il brano. Tali proprietà possono essere utilizzate per cercare il brano nella lista generale. Le proprietà vengono scritte in parentesi quadrata e separate da punto e virgola. Segue un esempio:

# help.editor.title.description
source: Defines the title of a song.
de: Gibt den Titel des Liedes an.
es: Indicar un título.
it: Indica il titolo del brano.

# help.editor.artist.description
source: Defines the artists of a song.
de: Gibt den Künstler eines Liedes an.
es: Indicar la ártista de una canción.
it: Indica l'autore del brano.

# help.editor.bpm.description
source: Defines the beats per minute.
de: Gibt die Geschwindigkeit eines Liedes an.
es: Indicar el tempo.
it: Indica la velocità di metronomo del brano.

# help.editor.books.description
source: With books you can references to songbooks and their numbers. All books needs to be separated by commas.
de: Mit books können Bücher mit ihren Nummern referenziert werden. Alle Bücher müssen durch Kommata getrennt werden.
es: Con books puedes referenciar cancioneros. Todas tienes que seperar con comas.
it: Il riferimento tra raccolte e loro numeri avviene attraverso la proprietà books. Le raccolte devono essere separate da una virgola.

# help.editor.blocks.title
source: Blocks
de: Blöcke
es: Bloques
it: Sezioni

# help.editor.blocks.description
source: If a song is structured in different sections and these sections are repeated multiple times, it can be useful to organize this song in different blocks. Each block is defined by the following:
de: Wenn ein Lied in viele Abschnitte gegliedert werden kann und einige Abschnitte sich wiederholen, kann es sich sehr lohnen, diese in Blöcken zu organisieren. Jeder Abschnitt startet mit folgendem Befehl:
es: Cuando una canción tiene muchas partes y unas partes se repeten, se merece la pena de organizar las en bloques. Un bloque empieza con:
it: Se un brano è strutturato in più parti e alcune di esse si ripetono, può essere conveniente organizzare il brano il sezioni. Ogni parte comincia con il seguente comando:

# help.editor.line.description
source: Each line of a song can contain chords and notes. Chords are written in square brackets. This is useful to ensure the right position of the chord which is right above the next character. Notes can be added by |. Each | symbol adds a column, in which notes can be added for different persons. To add different notes for different repetitions, each note can be seperated with ;. In the following example, the first column will contain 'break' in the third repetition of the block. In contrast to the second column, which will contain 'Mia 2. voice' in each repetition.
de: Jede Zeile eines Liedes beinhaltet Akkorde und kann durch Notizen ergänzt werden. Akkorde werden in eckige Klammern geschrieben. Dadurch wird sicher gestellt, dass alle Akkorde immer genau über dem folgenden Zeichen stehen. Notizen werden durch | hinzugefügt. Jedes | Symbol fügt eine Spalte hinzu, in der Notizen für verschiedene Personen festgehalten werden könne. Um verschiedene Notizen für verschiedene Wiederholungen anzulegen, kann jede Notiz für jede Wiederholung mit einem ; getrennt werden. Beim nachfolgenden Beispiel wird also bei der 3. Verwendung des Blocks 'Break' in der 1. Spalte erscheinen. In der 2. Spalte wird allerdings jedesmal 'Mia 2. Stimme' stehen.
es: Toda línea inclue acordes y puedes completar con notas. Acordes se escriben entre corchetes. Con esté, se asegure que todas acordes estan siempre arriba del carácter siguente. Notas añades con |. Todos | carácteres añaden una columna, en que puedes escribir notas para persones diferentes. Para agregar notas diferentes por repeticiones diferentes, puedes separar toda repectición con un punto y coma. En el ejemplo sigiuente va aparecer 'Break' en el tercero uso del bloque en la primera columna de notas. Pero en la segunda cada vez se escribe 'Mia 2. voz'.
it: Ogni riga di un brano contiene accordi e può contenere annotazioni. Gli accordi vengono scritti in parentesi quadre, affinché tutti gli accordi siano esattamente sopra la corrispondente sillaba. Per inserire le annotazioni usare il simbolo | che aggiunge una colonna dove queste verranno annotate per diversi utenti. Se a ripetizioni di parti del brano corrispondono diverse annotazioni, queste possono essere separate dal punto e virgola (;). Nell'esempio seguente comparirà nella prima colonna la scritta 'Break' soltanto alla terza ripetizione del blocco. Invece la scritta 'Seconde voci' comparirà ogni ripetizione nella seconda colonna.

# help.editor.line.secondAnnotation
source: Mia 2. voice
de: Mia 2. Stimme
es: Mia 2. voz
it: Seconde voci

# help.editor.order.title
source: Order
de: Reihenfolge
es: Orden
it: Ordine delle sezioni

# help.editor.order.description
source: To define a order of all blocks, the order keyword can be added. Important for this is, that each block label is spelled like they are in the block element. All blocks are seperated by , :
de: Um eine Reihenfolge der einzelnen Blöcke festzulegen, kann unter den generellen Informationen mit dem order Schlüsselwort diese festgelegt werden. Wichtig hierbei ist, dass alle Blöcke genau so geschrieben werden, wie sie im Block-Element eingeführt wurden. Alle Blöcke werden durch , getrennt:
es: Para fijar un orden de los bloques, puede escribirlo debajo de las informaciones generales con el palabra clave order. Es importa de escribir todos bloques como en el elemto. Todos bloques se sepera con un coma:
it: L'ordine delle sezioni si imposta con il comando order oppure nelle proprietà del brano. I nomi delle sezioni devono essere separati da virgole ed è importante che vengano scritti esattamente come nel comando block:

# help.editor.format.title
source: Formatting
de: Formatierungen
es: Formateo
it: Formattazione del testo

# help.editor.format.description
source: The lyrics can be formatted with the following elements.
de: Der Text eines Liedes kann mit folgenden Elementen formatiert werden.
es: Puedes formatear el text con los elementos siguientes:
it: Il testo di un brano può essere formattato con i seguenti comandi:

# help.editor.italic.description
source: italic text
de: schräger Text
es: texto itálico
it: corsivo

# help.editor.bold.description
source: bold text
de: dicker Text
es: texto negrita
it: grassetto

# help.editor.red.description
source: red text
de: roter Text
es: texto rojo
it: in rosso

# help.editor.green.description
source: green text
de: grüner Text
es: texto verde
it: in verde

# help.editor.blue.description
source: blue text
de: blauer Text
es: texto azúl
it: in blu

# help.performMode.title
source: Performmode
de: Vorführungsmodus
es: Modo de actuación
it: Modalità anteprima

# help.performMode.description
source: This mode can be used for events. With Enter and Space, you can navigate through the song. If the Performmode was started with an event, you will navigate to the next song after reaching the end of the current song.
de: Dieser Modus kann für Vorführungen benutzt werden. Mithilfe von Enter und Leertaste, kann in dieser Ansicht navigiert werden. Wird ein Event in diesem Modus gestartet, wird am Ende eines Liedes zu dem Nachfolgenden navigiert.
es: Esté modo puedes usar para actuaciones. Con la ayuda de la tecla Return y el espaciador, puedes navegar en está vista. Se comenza un evento en esté modo, al término de una canción se navega de la siguiente.
it: In questa modalità si può visualizzare l'anteprima del brano. Attraverso i tasti Spazio e Enter si può navigare nell'anteprima. Se si apre un evento in questa modalità, alla fine di ogni brano si vedrà il brano successivo.

# help.mergeDialog.title
source: Merge dialog
es: Diálogo de reunir
it: Finestra di confronto

# help.mergeDialog.description
source: If Songmachine is used in combination with Dropbox as your data location, there can be the case where a person has changed the same song as you have edited. In this case, when you want to save your changes a dialog will open, which contains all information of the local changes and of changes inside of Dropbox. You will have the choice of either ignoring the changes from Dropbox, ignoring your changes or merging both changes in the textfield in the middle.
de: Wird Songmachine in Verbindung mit einem Speicherort in einer Dropbox o.ä. genutzt, kann es in seltenen Fällen dazu kommen, dass eine andere Person das selbe Lied verändert hat, dass gespeichert werden soll. In diesem Fall wird sich ein Dialog öffnen, in dem die lokalen Änderung und die aus der Dropbox angezeigt werden. Es kann nun entweder nur eine der beiden Versionen behalten werden, oder eine Version im mittleren Textfeld erstellt werden, die beide Änderungen berücksichtigt.
es: Cuando usas Songmachine con Dropbox, Google Drive o parecidos como un lugar de guardar, en casos raros una persona ha podido modificar el mismo cancion como tú. En esté caso cuando puedes guardar tús modificaciones, un diálogo abre dónde puedes reunirlas con las en el Dropbox. Puedes usar solo las modificaciones de una version o crear una version nueva en el medio de las otras versiones.
it: Se si collega Songmachine ad una cartella Dropbox, può succedere che un'altra persona abbia modificato il brano che si ha appena finito di modificare e che si vuole salvare. In questo caso si apre una finestra che mostra le modifiche locali e quelle esterne. Si può mantenere una delle due versioni, oppure creare nel campo di testo intermedio una versione che contenga entrambe le modifiche.

# help.action.close
source: close
de: Schließen
es: Cerrar
it: Chiudere

# merge.local.headline
source: local changes
de: Lokale Änderungen
es: Modificaciones locales
it: Modifiche locali

# merge.final.headline
source: merged changes
de: Zusammengeführte Änderungen
es: Modificaciones reunidas
it: Modifiche congiunte

# merge.server.headline
source: foreign changes
de: Fremde Änderungen
es: Modificaciones ajenas
it: Modifiche esterne

# merge.dialog.cancel
source: cancel
de: Abbrechen
es: Cancelar
it: Annulla

# merge.dialog.ignoreServer
source: ignore foreign changes
de: Ignoriere fremde Änderungen
es: Ignorarlas ajenas
it: Ignora le modifiche esterne

# merge.dialog.save
source: save merged changes
de: Speichere zusammengeführte Änderungen
es: Guardarlas reunidas
it: Salva le modifiche congiunte

# merge.dialog.ignoreLocal
source: ignore local changes
de: Ignoriere lokale Änderungen
es: Ignorarlas locales
it: Ignora le modifiche locali

# qr.hint
source: Jedes Endgerät kann sich mit folgender Adresse in einem beliebingen Browser öffnen und wird dort den Songtext sehen können.
es: Cada dispositivo puede abrir está dirección y mostrar las canciones.
it: Ogni dispositivo può vedere il brano, aprendo con qualsiasi browser il seguente indirizzo:

# form.new.song.title
source: Title
de: Titel
es: Título
it: Titolo

# form.new.song.title.hint
source: Please add a title.
de: Bitte einen Titel angeben.
es: Especifica un título.
it: Inserire un titolo.

# form.new.song.artist
source: Artist
de: Künstler
es: Ártistas
it: Autore

# form.new.song.books
source: Books
de: Bücher
es: Cancioneros
it: Raccolte

# form.new.songgroup.name
source: Title
de: Titel
es: Título
it: Titolo

# form.new.songgroup.description
source: Description
de: Beschreibung
es: Descripción
it: Descrizione

# form.new.songgroup.date
source: Date
de: Datum
es: Fecha
it: Data

# form.new.songgroup.selectASong
source: Choose a song
de: Wähle ein Lied
es: Selecciona una canción
it: Scegli un brano

# form.new.cancel
source: cancel
de: Abbrechen
es: Cancelar
it: Cancella

# form.new.save
source: Save
de: Speichern
es: Guardar
it: Salva

# browser.new
source: New song
de: Neues Lied
es: Canción nueva
it: Nuovo brano

# browser.import
source: Import song
de: Importiere Lied
es: Importar una canción
it: Importa un brano

# browser.headline.songs
source: Your songs
de: Deine Lieder
es: Tús canciones
it: I miei brani

# browser.headline.songgroups
source: Your events
de: Deine Events
es: Tús eventos
it: I miei eventi

# browser.search.songs
source: Search a song
de: Suche ein Lied
es: Busca una canción
it: Cerca un brano

# browser.search.songgroups
source: Search an event
de: Suche ein Event
es: Busca un evento
it: Cerca un evento

# browser.song.actions.editor
source: Editor
it: Modifica

# browser.song.actions.quickedit
source: Quickedit
es: editar rápido
it: Proprietà

# browser.song.actions.delete
source: Delete
de: Löschen
es: Eliminar
it: Rimuovi

# browser.songgroup.actions.performmode
source: Performmode
de: Vorführungsmodus
es: Modo de actuación
it: Anteprima

# editor.save
source: Save
de: Speichern
es: Guardar
it: Salva

# editor.performMode
source: Performmode
de: Vorführungsmodus
es: Modo de actuación
it: Anteprima

# editor.transpose
source: Transpose
de: Transponieren
es: Transportar
it: Trasportare

# settings.headline
source: Settings
de: Einstellungen
es: Ajustes
it: Impostazioni

# settings.path
source: Saving directory
de: Speicherort
es: Lugar de guardar
it: Cartella

# settings.select.folder
source: Choose a folder
de: Wähle einen Ordner
es: Selecciona una carpeta
it: Scegli una cartella

# settings.welcome.to.songsheet
source: Welcome to Songmachine!
de: Willkommen bei Songmachine!
es: Bienvenidos a Songmachine!
it: Benvenuto su Songmachine!

# settings.hint.default.path
source: To use Songmachine, the location of your data has to be set. If multiple persons should have access to your data, you should use Dropbox to share your folder with other persons. Additionally, it can be very helpful to read the helping informations first to get an overview of all functionalities. Have fun!
de: Um Songmachine nutzen zu können, muss ein Speicherort für alle Lieder und Events angegeben werden. Wenn mehrere Personen auf diese Dateien zugreifen sollen, wird empfohlen einen Speicherort innerhalb einer Dropbox anzugeben und diesen Ordner mithilfe von Dropbox mit verschiedenen Konten zu teilen. Hilfreich ist auch, sich erst einmal den Hilfebereich zu lesen, um einen guten Überblick über alle Funktionen zu bekommen. Viel Spaß!
es: Para usar Songmachine tienes que seleccionar una lugar de guardar. Cuando muchas personas deben acceder los datos, selecciona una carpeta en Dropbox, Google Drive u otras y compartela. También, recomende de leer las páginas de ayuda para obtener una vista general de todas funciones. ¡Que te diviertas!
it: Per utilizzare Songmachine devi scegliere una cartella dove salvare i tuoi brani e i tuoi eventi. Se più persone devono poter accedere a questi dati, ti consigliamo di salvarli su Dropbox per condividerli con diversi account. Consigliamo inoltre di leggere la sezione Help, per conoscere tutte le funzionalità di Songmachine. Buon divertimento!

# alert.confirm
source: Ok
es: Confirmar
